import java.util.Scanner;

public class Main {
    /*
     * План занятия
     * 1. Игра лотерея (консольная)
     * 2.
     * */

    /*
     *
     * */

    /*Теория
    Архитектура приложения:
    1. Создать класс для игры
    2. Методы игры
    3. Данные
    4. В главном методе запустить пользовательский (главный) объект
    5. Создать объект класса и воспользоваться им

    ТЗ на игру(требуемый набор функционала для проекта):
    Генерация выигрышной комбинации
    Ввод комбинации пользователя
    Проверка комбинаций пользователя
    Сделать метод для просмотра выигрышной комбинации (шанс сжульничать)
    Определение и вывод результата

    Реализация класса Lottery:
    Создать сканнер
    Создать рендом
    Создать методы, выполняющие каждую подзадачу
    Создать массивы для хранения комбинаций
     * */

    /*
     */

    /*Задачи *
     * Игра лотерея (с диалоговыми окнами)
     * */

    public static void main(String[] args) {
        System.out.println("Hello world!");
        GameHandling gameHandling = new GameHandling();

    }


}