public class Main {
    /*План занятия
    * 1) Введение в проф
    * 2) Повторение*/

    /*Теория
    * Java Core - ядро языка Java, сам язык - его базовые библиотеки
    * Спринг - фреймворк
    * Для прова потребуется InteliJ Idea платная версия
    * Джакарта, веб-сокеты, джавакор - спрашивают на собеседованиях
    * Сервлет - контейнер, обрабатывающий запросы от веб-страницы
    *
    * Андроид не нужно изучать с нуля - знать хотя бы середину профа*/
    public static void main(String[] args) {
        System.out.println("Hello world!");
    }
}