public class Main {
    /*Паттерн синглтон --> принцип единственной ответственности
    * Из разных частей кода мы можем получить доступ к объекту
    * Синглтон — это шаблон (паттерн) проектирования, который делает две вещи: Дает гарантию,
    * что у класса будет всего один экземпляр класса. Предоставляет глобальную точку доступа к
    * экземпляру данного класса. Синглтон (singleton) это класс, у которого экземпляр создаётся только один раз. */
    public static void main(String[] args) {
        System.out.println("Hello world!");
    }
}