/*План занятия
Углубленное знакомство с методами
Практика
Продвинутым:
1. Показать полиморфизм на примере методов и конструкторов
2. Переопределить методы у класса потомка
3. Создать консольный калькулятор, который будет выполнять вычисления до команды их прекратить
(бесконечный цикл, пока не введем команду "завершить работу", end)

 */

/*
 * Теория
 * Сигнатура метода содержит кроме названия тип метода, аргумены, передаваемые методу и раположение метода в памяти*
 * (static или не static) и модификатор доступа.
 */
 /*
 *  Заметки
 *
 */
public class Main {
    public static void main(String[] args) {
        System.out.println("Hello world!");
    }
}